app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "movies" SET "release_date" = '1968-02-06 00:00:00.000000', "updated_at" = '2014-06-06 05:27:11.200336' WHERE "movies"."id" = 7
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Petey Pablo' LIMIT 1
---
  def show_similar
    #populate @movie with calls to model
    @movie = Movie.find_by_id params[:id]
    @similar = {}
    redirect_to movies_path(error: "'#{@movie.title unless @movie.nil?}' has no director info") if @movie.nil? || @movie[:director].nil?
		#extra check...can be removed
		if @movie[:director].nil? == false
  	  flash[:notice] = "Only showing movies with same director as #{@movie[:title]}"
		  @similar = Movie.find_all_by_director(@movie[:director])